In [27]:
import pandas as pd
import numpy as np

In [28]:
data = pd.read_csv('7777.csv')

In [29]:
data.head()

                                        Name
0                                          8
1  RADIO WITH KEY REMOTE SPIKA NDOGO. 20,000
2                                          9
3  RADIO WITH KEY REMOTE SPIKA KATI.  21,000
4                                         10

In [30]:
data['Name'].str.contains('.').value_counts()[True]

110

In [31]:
# create a column 

data.shape

(110, 1)

In [32]:

data.head()

                                        Name
0                                          8
1  RADIO WITH KEY REMOTE SPIKA NDOGO. 20,000
2                                          9
3  RADIO WITH KEY REMOTE SPIKA KATI.  21,000
4                                         10

In [33]:

# data = data[data['Nigeria custum: PRICE LIST FOR MOTORCYCLE SPARE PARTS'].str.len()>=3]
# data.head()

In [34]:
data2 = data.rename(columns={"Name": "Parts"})

In [35]:
data2.shape

(110, 1)

In [36]:
# using pandas.Series.str allows us to implement "normal" string methods 
# (like split) on a Series
data2.astype('str')

                                         Parts
0                                            8
1    RADIO WITH KEY REMOTE SPIKA NDOGO. 20,000
2                                            9
3    RADIO WITH KEY REMOTE SPIKA KATI.  21,000
4                                           10
..                                         ...
105                   MEKA NDOGO SANA . 800PCS
106                                         62
107             EPOXY ARLIDITE KUBWA.   25,000
108                                         63
109                      BRAKE PAD GN125. 1000

[110 rows x 1 columns]

In [37]:
data2['Parts'] = data2['Parts'].str.replace(',','')
# df['x']=df['x'].str.replace(',','')

In [38]:
data2.head()

                                      Parts
0                                         8
1  RADIO WITH KEY REMOTE SPIKA NDOGO. 20000
2                                         9
3  RADIO WITH KEY REMOTE SPIKA KATI.  21000
4                                        10

In [39]:

# data2['Price'] = data2['Parts'].str.split('.').str[1]


# data2.head()

In [40]:
data2['Price'] = data2['Parts'].str.split('.').str[1]
data2.head()

                                      Parts    Price
0                                         8      NaN
1  RADIO WITH KEY REMOTE SPIKA NDOGO. 20000    20000
2                                         9      NaN
3  RADIO WITH KEY REMOTE SPIKA KATI.  21000    21000
4                                        10      NaN

In [41]:

print (data2['Price'].iloc[0])

nan

In [42]:
for index, row in data2.iterrows():
    data2.astype('str') 
    find = data2['Price'].iloc[index]
    
    string = data2['Parts'].iloc[index]
    find = str(find) 
    string = str(string)
    go = string.replace(find, "") 
    data2['Parts'].iloc[index] = go
    # f["text"] = [str(x).replace(':',' ') for x in df["text"]]
    # data2['Parts'].iloc[index] = go
    # new = print(data2['Parts'].string.replace(find, ""))
    # string.replace("1", "") 
    # print(go)
data2.head()

                                Parts    Price
0                                   8      NaN
1  RADIO WITH KEY REMOTE SPIKA NDOGO.    20000
2                                   9      NaN
3   RADIO WITH KEY REMOTE SPIKA KATI.    21000
4                                  10      NaN

In [43]:

data2 = data2[data2['Parts'].str.len()>=3]
data2.head()

                                Parts    Price
1  RADIO WITH KEY REMOTE SPIKA NDOGO.    20000
3   RADIO WITH KEY REMOTE SPIKA KATI.    21000
5  RADIO WITH KEY REMOTE SPIKA KUBWA.    22000
7     RADIO KAMA HOPERAY SPIKA NDOGO.    22000
9     RADIO KAMA HOPERAY SPIKA KUBWA.    24000

In [44]:
# data2[Id] = np.arange(1, len(data2)-1)
# data2.head()

In [45]:
# data2['Price'] = [x.split('.')[1] for x in data2['Parts']]
# data2.head()

In [46]:
# data2['Parts'] = data2['Parts'].split(".", 1)

In [47]:
# # # sep = '.'
# # # data2['Parts'].astype('str') 
# # # data2['new'] = data2['Parts'].split(sep, 1)[0]
# # sub_str = "."
# # data2['new'] = data2['Parts'][:data2['Parts'].index(sub_str) + len(sub_str)]

# # 

# data2['Parts'][data2['Parts'].rindex('-')+1:]
# data2.head()

In [48]:
csv_data = data2.to_csv('7778.csv', index=False)